{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 90,
   "id": "cfc4aad4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "from langchain_core.runnables import (\n",
    "    RunnableBranch,\n",
    "    RunnableLambda,\n",
    "    RunnableParallel,\n",
    "    RunnablePassthrough,\n",
    ")\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.prompts.prompt import PromptTemplate\n",
    "from pydantic import BaseModel, Field\n",
    "from typing import Tuple, List\n",
    "from langchain_core.messages import AIMessage, HumanMessage\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_community.document_loaders import WikipediaLoader\n",
    "from langchain.text_splitter import TokenTextSplitter\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "\n",
    "from langchain_neo4j import Neo4jVector\n",
    "from langchain_openai import OpenAIEmbeddings\n",
    "from langchain_neo4j.vectorstores.neo4j_vector import remove_lucene_chars"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "d87431d2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_dotenv(override=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "f44278df",
   "metadata": {},
   "outputs": [],
   "source": [
    "AURA_INSTANCENAME = os.environ[\"AURA_INSTANCENAME\"]\n",
    "NEO4J_URI = os.environ[\"NEO4J_URI\"]\n",
    "NEO4J_USERNAME = os.environ[\"NEO4J_USERNAME\"]\n",
    "NEO4J_PASSWORD = os.environ[\"NEO4J_PASSWORD\"]\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "OPENAI_API_KEY = os.getenv(\"OPENAI_API_KEY\")\n",
    "OPENAI_ENDPOINT = os.getenv(\"OPENAI_ENDPOINT\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "dc464219",
   "metadata": {},
   "outputs": [],
   "source": [
    "chat = ChatOpenAI(api_key=OPENAI_API_KEY, temperature=0, model=\"gpt-4o-mini\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "3aa8e6fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    ") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "c4ee16cf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[Document(metadata={}, page_content='\\n        The Maratha Empire, also referred to as the Maratha Confederacy, was an early modern polity in the Indian subcontinent. For most of its existence, it comprised the realms of the Peshwa and four major independent Maratha states under the nominal leadership of the former and nominal loyalty to the Chhatrapatis who were successors of Chhatrapati Shivaji Maharaj.\\n\\n        The Marathas were a Marathi-speaking warrior group from the western Deccan Plateau (present-day Maharashtra) that rose to prominence under leadership of Shivaji (17th century), who revolted against the Bijapur Sultanate and the Mughal Empire for establishing \"Hindavi Swarajya\" (lit.\\u2009\\'self-rule of Hindus\\').\\n\\n        The religious attitude of Emperor Aurangzeb estranged non-Muslims, and the Maratha insurgency came at a great cost for his men and treasury. The Maratha government also included warriors, administrators, and other nobles from other Marathi groups.\\n        Chhatrapati Shivaji Maharaj’s monarchy, referred to as the Maratha Kingdom, expanded into a large realm in the 18th century under the leadership of Peshwa Bajirao I. Marathas from the time of Shahu I recognised the Mughal emperor as their nominal suzerain, similar to other contemporary Indian entities, though in practice, Mughal politics were largely controlled by the Marathas between 1737 and 1803.\\n\\n        After Aurangzeb\\'s death in 1707, Chhatrapati Shivaji Maharaj\\'s grandson Shahu under the leadership of Peshwa Bajirao revived Maratha power and confided a great deal of authority to the Bhat family, who became hereditary peshwas (prime ministers). \\n        After he died in 1749, they became the effective rulers. The leading Maratha families – Scindia, Holkar, Bhonsle, and Gaekwad – extended their conquests in northern and central India and became more independent. The Marathas\\' rapid expansion was halted with the defeat of Panipat in 1761, at the hands of the Durrani Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Peshwa Madhavrao I.[28] His death eventually marked the end of Peshwa’s effective authority over other chiefs in the empire. After he was defeated by the Holkar dynasty in 1802, the Peshwa Baji Rao II sought protection from the British East India Company, whose intervention destroyed the confederacy by 1818 after the Second and Third Anglo-Maratha Wars.\\n\\n        The structure of the Maratha state was that of a confederacy of four rulers under the leadership of the Peshwa at Poona (now Pune) in western India. These were the Scindia, the Gaekwad based in Baroda, the Holkar based in Indore and the Bhonsle based in Nagpur. The stable borders of the confederacy after the Battle of Bhopal in 1737 extended from modern-day Maharashtra in the south to Gwalior in the north, to Orissa in the east or about a third ( 2.5 million km2) of the subcontinent.\\n        ')]\n"
     ]
    }
   ],
   "source": [
    "# # # read the wikipedia page for the Roman Empire\n",
    "# raw_documents = WikipediaLoader(query=\"The Roman empire\").load()\n",
    "\n",
    "from langchain_core.documents import Document\n",
    "raw_documents = [\n",
    "    Document(\n",
    "        page_content=\"\"\"\n",
    "        The Maratha Empire, also referred to as the Maratha Confederacy, was an early modern polity in the Indian subcontinent. For most of its existence, it comprised the realms of the Peshwa and four major independent Maratha states under the nominal leadership of the former and nominal loyalty to the Chhatrapatis who were successors of Chhatrapati Shivaji Maharaj.\n",
    "\n",
    "        The Marathas were a Marathi-speaking warrior group from the western Deccan Plateau (present-day Maharashtra) that rose to prominence under leadership of Shivaji (17th century), who revolted against the Bijapur Sultanate and the Mughal Empire for establishing \"Hindavi Swarajya\" (lit. 'self-rule of Hindus').\n",
    "\n",
    "        The religious attitude of Emperor Aurangzeb estranged non-Muslims, and the Maratha insurgency came at a great cost for his men and treasury. The Maratha government also included warriors, administrators, and other nobles from other Marathi groups.\n",
    "        Chhatrapati Shivaji Maharaj’s monarchy, referred to as the Maratha Kingdom, expanded into a large realm in the 18th century under the leadership of Peshwa Bajirao I. Marathas from the time of Shahu I recognised the Mughal emperor as their nominal suzerain, similar to other contemporary Indian entities, though in practice, Mughal politics were largely controlled by the Marathas between 1737 and 1803.\n",
    "\n",
    "        After Aurangzeb's death in 1707, Chhatrapati Shivaji Maharaj's grandson Shahu under the leadership of Peshwa Bajirao revived Maratha power and confided a great deal of authority to the Bhat family, who became hereditary peshwas (prime ministers). \n",
    "        After he died in 1749, they became the effective rulers. The leading Maratha families – Scindia, Holkar, Bhonsle, and Gaekwad – extended their conquests in northern and central India and became more independent. The Marathas' rapid expansion was halted with the defeat of Panipat in 1761, at the hands of the Durrani Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Peshwa Madhavrao I.[28] His death eventually marked the end of Peshwa’s effective authority over other chiefs in the empire. After he was defeated by the Holkar dynasty in 1802, the Peshwa Baji Rao II sought protection from the British East India Company, whose intervention destroyed the confederacy by 1818 after the Second and Third Anglo-Maratha Wars.\n",
    "\n",
    "        The structure of the Maratha state was that of a confederacy of four rulers under the leadership of the Peshwa at Poona (now Pune) in western India. These were the Scindia, the Gaekwad based in Baroda, the Holkar based in Indore and the Bhonsle based in Nagpur. The stable borders of the confederacy after the Battle of Bhopal in 1737 extended from modern-day Maharashtra in the south to Gwalior in the north, to Orissa in the east or about a third ( 2.5 million km2) of the subcontinent.\n",
    "        \"\"\"\n",
    "    )\n",
    "]\n",
    "\n",
    "print(raw_documents)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 95,
   "id": "53389fac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[Document(metadata={}, page_content='\\n        The Maratha Empire, also referred to as the Maratha Confederacy, was an early modern polity in the Indian subcontinent. For most of its existence, it comprised the realms of the Peshwa and four major independent Maratha states under the nominal leadership of the former and nominal loyalty to the Chhatrapatis who were successors of Chhatrapati Shivaji Maharaj.\\n\\n        The Marathas were a Marathi-speaking warrior group from the western Deccan Plateau (present-day Maharashtra) that rose to prominence under leadership of Shivaji (17th century), who revolted against the Bijapur Sultanate and the Mughal Empire for establishing \"Hindavi Swarajya\" (lit.\\u2009\\'self-rule of Hindus\\').\\n\\n        The religious attitude of Emperor Aurangzeb estranged non-Muslims, and the Maratha insurgency came at a great cost for his men and treasury. The Maratha government also included warriors, administrators, and other nobles from other Marathi groups.\\n        Chhatrapati Shivaji Maharaj’s monarchy, referred to as the Maratha Kingdom, expanded into a large realm in the 18th century under the leadership of Peshwa Bajirao I. Marathas from the time of Shahu I recognised the Mughal emperor as their nominal suzerain, similar to other contemporary Indian entities, though in practice, Mughal politics were largely controlled by the Marathas between 1737 and 1803.\\n\\n        After Aurangzeb\\'s death in 1707, Chhatrapati Shivaji Maharaj\\'s grandson Shahu under the leadership of Peshwa Bajirao revived Maratha power and confided a great deal of authority to the Bhat family, who became hereditary peshwas (prime ministers). \\n        After he died in 1749, they became the effective rulers. The leading Maratha families – Scindia, Holkar, Bhonsle, and Gaekwad – extended their conquests in northern and central India and became more independent. The Marathas\\' rapid expansion was halted with the defeat of Panipat in 1761, at the hands of the Durrani Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Pesh'), Document(metadata={}, page_content=' Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Peshwa Madhavrao I.[28] His death eventually marked the end of Peshwa’s effective authority over other chiefs in the empire. After he was defeated by the Holkar dynasty in 1802, the Peshwa Baji Rao II sought protection from the British East India Company, whose intervention destroyed the confederacy by 1818 after the Second and Third Anglo-Maratha Wars.\\n\\n        The structure of the Maratha state was that of a confederacy of four rulers under the leadership of the Peshwa at Poona (now Pune) in western India. These were the Scindia, the Gaekwad based in Baroda, the Holkar based in Indore and the Bhonsle based in Nagpur. The stable borders of the confederacy after the Battle of Bhopal in 1737 extended from modern-day Maharashtra in the south to Gwalior in the north, to Orissa in the east or about a third ( 2.5 million km2) of the subcontinent.\\n        ')]\n"
     ]
    }
   ],
   "source": [
    "# Define chunking strategy\n",
    "text_splitter = TokenTextSplitter(chunk_size=512, chunk_overlap=24)\n",
    "documents = text_splitter.split_documents(raw_documents[:3])\n",
    "print(documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "0ebd30d7",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm_transformer = LLMGraphTransformer(llm=chat)\n",
    "graph_documents = llm_transformer.convert_to_graph_documents(documents)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "5bcff4de",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('apoc.create.addLabels' has been replaced by 'Cypher's dynamic labels; `SET n:$(labels)`.')} {position: line: 1, column: 257, offset: 256} for query: \"MERGE (d:Document {id:$document.metadata.id}) SET d.text = $document.page_content SET d += $document.metadata WITH d UNWIND $data AS row MERGE (source:`__Entity__` {id: row.id}) SET source += row.properties MERGE (d)-[:MENTIONS]->(source) WITH source, row CALL apoc.create.addLabels( source, [row.type] ) YIELD node RETURN distinct 'done' AS result\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('apoc.create.addLabels' has been replaced by 'Cypher's dynamic labels; `SET n:$(labels)`.')} {position: line: 1, column: 257, offset: 256} for query: \"MERGE (d:Document {id:$document.metadata.id}) SET d.text = $document.page_content SET d += $document.metadata WITH d UNWIND $data AS row MERGE (source:`__Entity__` {id: row.id}) SET source += row.properties MERGE (d)-[:MENTIONS]->(source) WITH source, row CALL apoc.create.addLabels( source, [row.type] ) YIELD node RETURN distinct 'done' AS result\"\n"
     ]
    }
   ],
   "source": [
    "# store to neo4j\n",
    "res = kg.add_graph_documents(\n",
    "    graph_documents,\n",
    "    include_source=True,\n",
    "    baseEntityLabel=True,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7a74b7da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Use below cyper command to delete the Graphs present in neo4j\n",
    "# MATCH (n) DETACH DELETE n \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "f77652f3",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Hybrid Retrieval for RAG\n",
    "# create vector index\n",
    "vector_index = Neo4jVector.from_existing_graph(\n",
    "    OpenAIEmbeddings(),\n",
    "    search_type=\"hybrid\",\n",
    "    node_label=\"Document\",\n",
    "    text_node_properties=[\"text\"],\n",
    "    embedding_node_property=\"embedding\",\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "723e204d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Extract entities from text\n",
    "class Entities(BaseModel):\n",
    "    \"\"\"Identifying information about entities.\"\"\"\n",
    "\n",
    "    names: List[str] = Field(\n",
    "        ...,\n",
    "        description=\"All the person, organization, or business entities that \"\n",
    "        \"appear in the text\",\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "3cfb0fb8",
   "metadata": {},
   "outputs": [],
   "source": [
    "prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            \"You are extracting organization and person entities from the text.\",\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            \"Use the given format to extract information from the following \"\n",
    "            \"input: {question}\",\n",
    "        ),\n",
    "    ]\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "9fd51988",
   "metadata": {},
   "outputs": [],
   "source": [
    "entity_chain = prompt | chat.with_structured_output(Entities)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "1e78a872",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Aurangzeb', 'Chhatrapati Shivaji Maharaj', 'Shahu', 'Peshwa Bajirao', 'Bhat family']\n"
     ]
    }
   ],
   "source": [
    "# Test it out:\n",
    "res = entity_chain.invoke(\n",
    "    {\"question\": \"After Aurangzeb's death in 1707, Chhatrapati Shivaji Maharaj's grandson Shahu under the leadership of Peshwa Bajirao revived Maratha power and confided a great deal of authority to the Bhat family, who became hereditary peshwas (prime ministers).\"}\n",
    ").names\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "d83651c6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Retriever\n",
    "kg.query(\"CREATE FULLTEXT INDEX entity IF NOT EXISTS FOR (e:__Entity__) ON EACH [e.id]\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "5035795c",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_full_text_query(input: str) -> str:\n",
    "    \"\"\"\n",
    "    Generate a full-text search query for a given input string.\n",
    "\n",
    "    This function constructs a query string suitable for a full-text search.\n",
    "    It processes the input string by splitting it into words and appending a\n",
    "    similarity threshold (~2 changed characters) to each word, then combines\n",
    "    them using the AND operator. Useful for mapping entities from user questions\n",
    "    to database values, and allows for some misspelings.\n",
    "    \"\"\"\n",
    "    full_text_query = \"\"\n",
    "    words = [el for el in remove_lucene_chars(input).split() if el]\n",
    "    for word in words[:-1]:\n",
    "        full_text_query += f\" {word}~2 AND\"\n",
    "    full_text_query += f\" {words[-1]}~2\"\n",
    "    return full_text_query.strip()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "5cd9cad5",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Fulltext index query\n",
    "def structured_retriever(question: str) -> str:\n",
    "    \"\"\"\n",
    "    Collects the neighborhood of entities mentioned\n",
    "    in the question\n",
    "    \"\"\"\n",
    "    result = \"\"\n",
    "    entities = entity_chain.invoke({\"question\": question})\n",
    "    for entity in entities.names:\n",
    "        print(f\" Getting Entity: {entity}\")\n",
    "        response = kg.query(\n",
    "            \"\"\"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\n",
    "            YIELD node,score\n",
    "            CALL {\n",
    "              WITH node\n",
    "              MATCH (node)-[r:!MENTIONS]->(neighbor)\n",
    "              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\n",
    "              UNION ALL\n",
    "              WITH node\n",
    "              MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
    "              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\n",
    "            }\n",
    "            RETURN output LIMIT 50\n",
    "            \"\"\",\n",
    "            {\"query\": generate_full_text_query(entity)},\n",
    "        )\n",
    "        # print(response)\n",
    "        result += \"\\n\".join([el[\"output\"] for el in response])\n",
    "    return result\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "c89869a6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " Getting Entity: Chhatrapati Shivaji Maharaj\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is deprecated. Use CALL (node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              WITH node\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION ALL\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 50\\n            \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chhatrapati Shivaji Maharaj - ALSO_KNOWN_AS -> Shivaji\n",
      "Chhatrapati Shivaji Maharaj - LEADERSHIP -> Peshwa Bajirao I\n"
     ]
    }
   ],
   "source": [
    "print(structured_retriever(\"Who is Chhatrapati Shivaji Maharaj?\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "f19ce798",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Final retrieval step\n",
    "def retriever(question: str):\n",
    "    print(f\"Search query: {question}\")\n",
    "    structured_data = structured_retriever(question)\n",
    "    unstructured_data = [\n",
    "        el.page_content for el in vector_index.similarity_search(question)\n",
    "    ]\n",
    "    final_data = f\"\"\"Structured data:\n",
    "{structured_data}\n",
    "Unstructured data:\n",
    "{\"#Document \". join(unstructured_data)}\n",
    "    \"\"\"\n",
    "    print(f\"\\nFinal Data::: ==>{final_data}\")\n",
    "    return final_data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "e0c694ba",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define the RAG chain\n",
    "# Condense a chat history and follow-up question into a standalone question\n",
    "_template = \"\"\"Given the following conversation and a follow up question, rephrase the follow up question to be a standalone question,\n",
    "in its original language.\n",
    "Chat History:\n",
    "{chat_history}\n",
    "Follow Up Input: {question}\n",
    "Standalone question:\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "8cbd3f28",
   "metadata": {},
   "outputs": [],
   "source": [
    "CONDENSE_QUESTION_PROMPT = PromptTemplate.from_template(_template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "eb087880",
   "metadata": {},
   "outputs": [],
   "source": [
    "def _format_chat_history(chat_history: List[Tuple[str, str]]) -> List:\n",
    "    buffer = []\n",
    "    for human, ai in chat_history:\n",
    "        buffer.append(HumanMessage(content=human))\n",
    "        buffer.append(AIMessage(content=ai))\n",
    "    return buffer"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "9edd6719",
   "metadata": {},
   "outputs": [],
   "source": [
    "_search_query = RunnableBranch(\n",
    "    # If input includes chat_history, we condense it with the follow-up question\n",
    "    (\n",
    "        RunnableLambda(lambda x: bool(x.get(\"chat_history\"))).with_config(\n",
    "            run_name=\"HasChatHistoryCheck\"\n",
    "        ),  # Condense follow-up question and chat into a standalone_question\n",
    "        RunnablePassthrough.assign(\n",
    "            chat_history=lambda x: _format_chat_history(x[\"chat_history\"])\n",
    "        )\n",
    "        | CONDENSE_QUESTION_PROMPT\n",
    "        | ChatOpenAI(temperature=0)\n",
    "        | StrOutputParser(),\n",
    "    ),\n",
    "    # Else, we have no chat history, so just pass through the question\n",
    "    RunnableLambda(lambda x: x[\"question\"]),\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "b8bee1d4",
   "metadata": {},
   "outputs": [],
   "source": [
    "template = \"\"\"Answer the question based only on the following context:\n",
    "{context}\n",
    "\n",
    "Question: {question}\n",
    "Use natural language and be concise.\n",
    "Answer:\"\"\"\n",
    "prompt = ChatPromptTemplate.from_template(template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "id": "4b173209",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain = (\n",
    "    RunnableParallel(\n",
    "        {\n",
    "            \"context\": _search_query | retriever,\n",
    "            \"question\": RunnablePassthrough(),\n",
    "        }\n",
    "    )\n",
    "    | prompt\n",
    "    | chat\n",
    "    | StrOutputParser()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "id": "fd6c56a9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Search query: When did Aurangzeb die?\n",
      " Getting Entity: Aurangzeb\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is deprecated. Use CALL (node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              WITH node\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION ALL\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 50\\n            \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('db.index.vector.queryNodes' has been replaced by 'SEARCH')} {position: line: 1, column: 11, offset: 10} for query: \"CALL () { CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k WITH collect({node:node, score:score}) AS nodes, max(score) AS vector_index_max_score UNWIND nodes AS n RETURN n.node AS node, (n.score / vector_index_max_score) AS score UNION CALL db.index.fulltext.queryNodes($fulltext_index_name, $query_text, {limit: $top_k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS ft_index_max_score UNWIND nodes AS n RETURN n.node AS node, (n.score / ft_index_max_score) AS score } WITH node, max(score) AS score ORDER BY score DESC, elementId(node) LIMIT $top_k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Final Data::: ==>Structured data:\n",
      "Aurangzeb - ESTRANGED_NON_MUSLIMS -> Maratha Empire\n",
      "Unstructured data:\n",
      "\n",
      "text: \n",
      "        The Maratha Empire, also referred to as the Maratha Confederacy, was an early modern polity in the Indian subcontinent. For most of its existence, it comprised the realms of the Peshwa and four major independent Maratha states under the nominal leadership of the former and nominal loyalty to the Chhatrapatis who were successors of Chhatrapati Shivaji Maharaj.\n",
      "\n",
      "        The Marathas were a Marathi-speaking warrior group from the western Deccan Plateau (present-day Maharashtra) that rose to prominence under leadership of Shivaji (17th century), who revolted against the Bijapur Sultanate and the Mughal Empire for establishing \"Hindavi Swarajya\" (lit. 'self-rule of Hindus').\n",
      "\n",
      "        The religious attitude of Emperor Aurangzeb estranged non-Muslims, and the Maratha insurgency came at a great cost for his men and treasury. The Maratha government also included warriors, administrators, and other nobles from other Marathi groups.\n",
      "        Chhatrapati Shivaji Maharaj’s monarchy, referred to as the Maratha Kingdom, expanded into a large realm in the 18th century under the leadership of Peshwa Bajirao I. Marathas from the time of Shahu I recognised the Mughal emperor as their nominal suzerain, similar to other contemporary Indian entities, though in practice, Mughal politics were largely controlled by the Marathas between 1737 and 1803.\n",
      "\n",
      "        After Aurangzeb's death in 1707, Chhatrapati Shivaji Maharaj's grandson Shahu under the leadership of Peshwa Bajirao revived Maratha power and confided a great deal of authority to the Bhat family, who became hereditary peshwas (prime ministers). \n",
      "        After he died in 1749, they became the effective rulers. The leading Maratha families – Scindia, Holkar, Bhonsle, and Gaekwad – extended their conquests in northern and central India and became more independent. The Marathas' rapid expansion was halted with the defeat of Panipat in 1761, at the hands of the Durrani Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Pesh#Document \n",
      "text:  Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Peshwa Madhavrao I.[28] His death eventually marked the end of Peshwa’s effective authority over other chiefs in the empire. After he was defeated by the Holkar dynasty in 1802, the Peshwa Baji Rao II sought protection from the British East India Company, whose intervention destroyed the confederacy by 1818 after the Second and Third Anglo-Maratha Wars.\n",
      "\n",
      "        The structure of the Maratha state was that of a confederacy of four rulers under the leadership of the Peshwa at Poona (now Pune) in western India. These were the Scindia, the Gaekwad based in Baroda, the Holkar based in Indore and the Bhonsle based in Nagpur. The stable borders of the confederacy after the Battle of Bhopal in 1737 extended from modern-day Maharashtra in the south to Gwalior in the north, to Orissa in the east or about a third ( 2.5 million km2) of the subcontinent.\n",
      "        \n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# TEST it all out!\n",
    "res_simple = chain.invoke(\n",
    "    {\n",
    "        \"question\": \"When did Aurangzeb die?\",\n",
    "    }\n",
    ")\n",
    "\n",
    "# print(f\"\\n Results === {res_simple}\\n\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "id": "7fac85de",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Search query: Who founded the Maratha Empire?\n",
      " Getting Entity: Maratha Empire\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is deprecated. Use CALL (node) { ... }} {position: line: 3, column: 13, offset: 104} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit:2})\\n            YIELD node,score\\n            CALL {\\n              WITH node\\n              MATCH (node)-[r:!MENTIONS]->(neighbor)\\n              RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n              UNION ALL\\n              WITH node\\n              MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n              RETURN neighbor.id + ' - ' + type(r) + ' -> ' +  node.id AS output\\n            }\\n            RETURN output LIMIT 50\\n            \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('db.index.vector.queryNodes' has been replaced by 'SEARCH')} {position: line: 1, column: 11, offset: 10} for query: \"CALL () { CALL db.index.vector.queryNodes($vector_index_name, $top_k * $effective_search_ratio, $query_vector) YIELD node, score WITH node, score LIMIT $top_k WITH collect({node:node, score:score}) AS nodes, max(score) AS vector_index_max_score UNWIND nodes AS n RETURN n.node AS node, (n.score / vector_index_max_score) AS score UNION CALL db.index.fulltext.queryNodes($fulltext_index_name, $query_text, {limit: $top_k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS ft_index_max_score UNWIND nodes AS n RETURN n.node AS node, (n.score / ft_index_max_score) AS score } WITH node, max(score) AS score ORDER BY score DESC, elementId(node) LIMIT $top_k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Final Data::: ==>Structured data:\n",
      "Maratha Empire - ALSO_REFERRED_TO_AS -> Maratha Confederacy\n",
      "Maratha Empire - COMPRISED_OF -> Peshwa\n",
      "Maratha Empire - NOMINAL_LEADERSHIP -> Chhatrapatis\n",
      "Maratha Empire - DEFEATED_BY -> Durrani Empire\n",
      "Maratha Empire - RETREATED_UNDER_LEADERSHIP -> Peshwa\n",
      "Maratha Empire - LEADERSHIP -> Peshwa Madhavrao I\n",
      "Maratha Empire - PART_OF_CONFEDERACY -> Scindia\n",
      "Maratha Empire - PART_OF_CONFEDERACY -> Holkar\n",
      "Maratha Empire - PART_OF_CONFEDERACY -> Bhonsle\n",
      "Maratha Empire - PART_OF_CONFEDERACY -> Gaekwad\n",
      "Maratha Empire - EXTENDS_TO -> Maharashtra\n",
      "Maratha Empire - EXTENDS_TO -> Gwalior\n",
      "Maratha Empire - EXTENDS_TO -> Orissa\n",
      "Maratha Empire - EXTENDED_TO -> Orissa\n",
      "Maratha Empire - DEFEATED_AT_PANIPAT -> Durrani Empire\n",
      "Maratha Empire - RETAKE_TERRITORIES -> Peshwa\n",
      "Aurangzeb - ESTRANGED_NON_MUSLIMS -> Maratha Empire\n",
      "Peshwa Bajirao I - EFFECTIVE_RULERS -> Maratha Empire\n",
      "Scindia - EXTENDED_CONQUESTS -> Maratha Empire\n",
      "Holkar - EXTENDED_CONQUESTS -> Maratha Empire\n",
      "Bhonsle - EXTENDED_CONQUESTS -> Maratha Empire\n",
      "Gaekwad - EXTENDED_CONQUESTS -> Maratha Empire\n",
      "British East India Company - INTERVENTION -> Maratha Empire\n",
      "Peshwa Bajirao I - EXPANDED_REALM -> Maratha Empire\n",
      "Unstructured data:\n",
      "\n",
      "text: \n",
      "        The Maratha Empire, also referred to as the Maratha Confederacy, was an early modern polity in the Indian subcontinent. For most of its existence, it comprised the realms of the Peshwa and four major independent Maratha states under the nominal leadership of the former and nominal loyalty to the Chhatrapatis who were successors of Chhatrapati Shivaji Maharaj.\n",
      "\n",
      "        The Marathas were a Marathi-speaking warrior group from the western Deccan Plateau (present-day Maharashtra) that rose to prominence under leadership of Shivaji (17th century), who revolted against the Bijapur Sultanate and the Mughal Empire for establishing \"Hindavi Swarajya\" (lit. 'self-rule of Hindus').\n",
      "\n",
      "        The religious attitude of Emperor Aurangzeb estranged non-Muslims, and the Maratha insurgency came at a great cost for his men and treasury. The Maratha government also included warriors, administrators, and other nobles from other Marathi groups.\n",
      "        Chhatrapati Shivaji Maharaj’s monarchy, referred to as the Maratha Kingdom, expanded into a large realm in the 18th century under the leadership of Peshwa Bajirao I. Marathas from the time of Shahu I recognised the Mughal emperor as their nominal suzerain, similar to other contemporary Indian entities, though in practice, Mughal politics were largely controlled by the Marathas between 1737 and 1803.\n",
      "\n",
      "        After Aurangzeb's death in 1707, Chhatrapati Shivaji Maharaj's grandson Shahu under the leadership of Peshwa Bajirao revived Maratha power and confided a great deal of authority to the Bhat family, who became hereditary peshwas (prime ministers). \n",
      "        After he died in 1749, they became the effective rulers. The leading Maratha families – Scindia, Holkar, Bhonsle, and Gaekwad – extended their conquests in northern and central India and became more independent. The Marathas' rapid expansion was halted with the defeat of Panipat in 1761, at the hands of the Durrani Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Pesh#Document \n",
      "text:  Empire. However, the Marathas managed to retake most of their lost territories ten years later under the leadership of Peshwa Madhavrao I.[28] His death eventually marked the end of Peshwa’s effective authority over other chiefs in the empire. After he was defeated by the Holkar dynasty in 1802, the Peshwa Baji Rao II sought protection from the British East India Company, whose intervention destroyed the confederacy by 1818 after the Second and Third Anglo-Maratha Wars.\n",
      "\n",
      "        The structure of the Maratha state was that of a confederacy of four rulers under the leadership of the Peshwa at Poona (now Pune) in western India. These were the Scindia, the Gaekwad based in Baroda, the Holkar based in Indore and the Bhonsle based in Nagpur. The stable borders of the confederacy after the Battle of Bhopal in 1737 extended from modern-day Maharashtra in the south to Gwalior in the north, to Orissa in the east or about a third ( 2.5 million km2) of the subcontinent.\n",
      "        \n",
      "    \n",
      "\n",
      " === Chhatrapati Shivaji Maharaj founded the Maratha Empire.\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "res_hist = chain.invoke(\n",
    "    {\n",
    "        \"question\": \"Who founded the Maratha Empire?\",\n",
    "        \"chat_history\": [\n",
    "            (\"Who founded the Maratha Empire?\", \"Chhatrapati Shivaji Maharaj founded the Maratha Empire.\")\n",
    "        ],\n",
    "    }\n",
    ")\n",
    "\n",
    "print(f\"\\n === {res_hist}\\n\\n\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
