{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 188,
   "id": "cfc4aad4",
   "metadata": {},
   "outputs": [],
   "source": [
    "import csv\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "from langchain_neo4j import Neo4jGraph\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_openai import OpenAIEmbeddings"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "id": "d87431d2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 189,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "load_dotenv(override=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 190,
   "id": "f44278df",
   "metadata": {},
   "outputs": [],
   "source": [
    "AURA_INSTANCENAME = os.environ[\"AURA_INSTANCENAME\"]\n",
    "NEO4J_URI = os.environ[\"NEO4J_URI\"]\n",
    "NEO4J_USERNAME = os.environ[\"NEO4J_USERNAME\"]\n",
    "NEO4J_PASSWORD = os.environ[\"NEO4J_PASSWORD\"]\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "OPENAI_API_KEY = os.getenv(\"OPENAI_API_KEY\")\n",
    "OPENAI_ENDPOINT = os.getenv(\"OPENAI_ENDPOINT\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 191,
   "id": "dc464219",
   "metadata": {},
   "outputs": [],
   "source": [
    "chat = ChatOpenAI(api_key=OPENAI_API_KEY, temperature=0, model=\"gpt-4o-mini\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "3aa8e6fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "kg = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    ") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "59ed6910",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Delete existing data in the graph database.\n",
    "def delete_existing_data():\n",
    "    kg.query(\"\"\"\n",
    "    MATCH (n)\n",
    "    DETACH DELETE n\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "2e860de6",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_node(node_type: str, name: str, description: str = \"\"):\n",
    "    query = f\"\"\"\n",
    "    MERGE (n:Entity:{node_type} {{name: $name}})\n",
    "    SET n.description = $description,\n",
    "        n.updatedOn = datetime()\n",
    "    RETURN elementId(n) AS nodeId,\n",
    "           labels(n) AS labels,\n",
    "           n.name AS name,\n",
    "           n.description AS description\n",
    "    \"\"\"\n",
    "\n",
    "    result = kg.query(\n",
    "        query,\n",
    "        params={\n",
    "            \"name\": name,\n",
    "            \"description\": description\n",
    "        }\n",
    "    )\n",
    "    \n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "07b5a61d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_relationship(parent_name: str, child_name: str, relation: str):\n",
    "    query = f\"\"\"\n",
    "    MATCH (p {{name:$parent_name}})\n",
    "    MATCH (c {{name:$child_name}})\n",
    "    MERGE (p)-[r:{relation}]->(c)\n",
    "    RETURN p.name AS parent,\n",
    "           type(r) AS relation,\n",
    "           c.name AS child\n",
    "    \"\"\"\n",
    "\n",
    "    result = kg.query(\n",
    "        query,\n",
    "        params={\n",
    "            \"parent_name\": parent_name,\n",
    "            \"child_name\": child_name\n",
    "        }\n",
    "    )\n",
    "    \n",
    "    return result\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 196,
   "id": "9c6bb369",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_fmea_nodes(file_name: str):    \n",
    "    with open(file_name, mode=\"r\") as file:\n",
    "        reader = csv.DictReader(file)\n",
    "        for row in reader:\n",
    "            node_name = row[\"Name\"]\n",
    "            node_description = row[\"Description\"]\n",
    "            node_type = row[\"Type\"]\n",
    "            create_node(node_type, node_name, node_description)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "id": "e1babc4e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def build_fmea_tree(file_name: str):    \n",
    "    with open(file_name, mode=\"r\") as file:\n",
    "        reader = csv.DictReader(file)\n",
    "        for row in reader:\n",
    "            node1 = row[\"Primary Node\"]\n",
    "            relation_type = row[\"Relation Type\"]\n",
    "            node2 = row[\"Secondary Node\"]\n",
    "            create_relationship(node1, node2, relation_type)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "id": "1ed7e88c",
   "metadata": {},
   "outputs": [],
   "source": [
    "delete_existing_data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "27a90811",
   "metadata": {},
   "outputs": [],
   "source": [
    "create_fmea_nodes(\"./fmea_nodes.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "6ed6d5d8",
   "metadata": {},
   "outputs": [],
   "source": [
    "build_fmea_tree(\"./fmea_nodes_relations.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 201,
   "id": "5f85ae3a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Select embeddings model.\n",
    "embeddings = OpenAIEmbeddings(\n",
    "    api_key=OPENAI_API_KEY,\n",
    "    model=\"text-embedding-3-small\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 202,
   "id": "0ccfc996",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create text for embedding of each node in the graph database.\n",
    "def create_embedding():\n",
    "    query = \"\"\"\n",
    "    MATCH (n)\n",
    "    RETURN elementId(n) as nodeId,\n",
    "        labels(n) as labels,\n",
    "        n.name as name,\n",
    "        n.description as description\n",
    "    \"\"\"\n",
    "    nodes = kg.query(query)\n",
    "\n",
    "    # Generate vector embeddings for each node and update the graph database with the embedding vector.\n",
    "    for node in nodes:\n",
    "\n",
    "        text = f\"\"\"\n",
    "        Type: {node['labels'][0]}\n",
    "        Name: {node['name']}\n",
    "        Description: {node['description']}\n",
    "        \"\"\"\n",
    "\n",
    "        vector = embeddings.embed_query(text)\n",
    "\n",
    "        kg.query(\"\"\"\n",
    "            MATCH (n)\n",
    "            WHERE elementId(n)=$nodeId\n",
    "            SET n.embedding=$embedding\n",
    "        \"\"\",\n",
    "        params={\n",
    "            \"nodeId\": node[\"nodeId\"],\n",
    "            \"embedding\": vector\n",
    "        })"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 203,
   "id": "651e7a1b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def delete_existing_vector_indexes():\n",
    "    kg.query(\"\"\"\n",
    "    DROP INDEX fmea_vector_index IF EXISTS\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 204,
   "id": "1aeaa7ab",
   "metadata": {},
   "outputs": [],
   "source": [
    "def show_vector_indexes():\n",
    "    print(kg.query(\"\"\"\n",
    "    SHOW VECTOR INDEXES\n",
    "    \"\"\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 205,
   "id": "978bdec7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create Neo4j Vector Index\n",
    "def create_vector_index():\n",
    "    kg.query(\"\"\"\n",
    "    CREATE VECTOR INDEX fmea_vector_index IF NOT EXISTS\n",
    "    FOR (n:Entity)\n",
    "    ON (n.embedding)\n",
    "    OPTIONS {\n",
    "        indexConfig: {\n",
    "            `vector.dimensions`: 1536,\n",
    "            `vector.similarity_function`: 'cosine'\n",
    "        }\n",
    "    }\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 206,
   "id": "9e4c24ac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "delete_existing_vector_indexes()\n",
    "show_vector_indexes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 207,
   "id": "7f7f291c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'id': 5, 'name': 'fmea_vector_index', 'state': 'ONLINE', 'populationPercent': 100.0, 'type': 'VECTOR', 'entityType': 'NODE', 'labelsOrTypes': ['Entity'], 'properties': ['embedding'], 'indexProvider': 'vector-3.0', 'owningConstraint': None, 'lastRead': None, 'readCount': None}]\n"
     ]
    }
   ],
   "source": [
    "create_embedding()\n",
    "create_vector_index()\n",
    "show_vector_indexes()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 220,
   "id": "9dfe642d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def talk(question: str):\n",
    "    \n",
    "    query_vector = embeddings.embed_query(question)\n",
    "    results = kg.query(\"\"\"\n",
    "    CALL db.index.vector.queryNodes(\n",
    "        'fmea_vector_index',\n",
    "        5,\n",
    "        $embedding\n",
    "    )\n",
    "    YIELD node, score\n",
    "\n",
    "    RETURN node.name as name,\n",
    "        node.description as description,\n",
    "        labels(node) as labels,\n",
    "        score\n",
    "    \"\"\",\n",
    "    params={\n",
    "        \"embedding\": query_vector\n",
    "    })\n",
    "    \n",
    "    graph_context = \"\"\n",
    "    if results:\n",
    "        matched_node = results[0][\"name\"]\n",
    "        print(f\"Matched Node: {matched_node}\")\n",
    "        graph_context = kg.query(\"\"\"\n",
    "        MATCH (n {name:$name})-[r*1..2]->(m)\n",
    "        RETURN\n",
    "            labels(n) as NodeType,\n",
    "            n.name AS Node,\n",
    "            [rel IN r | type(rel)] AS Relations,\n",
    "            m.name AS AssociatedNode\n",
    "        \"\"\",\n",
    "        params={\n",
    "            \"name\": matched_node\n",
    "        })\n",
    "        \n",
    "    context = \"\"\n",
    "    for row in graph_context:\n",
    "        context += str(row) + \"\\n\"\n",
    "   \n",
    "    prompt = f\"\"\"\n",
    "    You are an FMEA (Failure Modes and Effects Analysis) expert.\n",
    "\n",
    "    Refer the graph context to answer the question related to FMEA.\n",
    "    Kindly provide straight forward answer.\n",
    "     \n",
    "    Exampple:\n",
    "    Question: Which could be the potential child system element of Car Air filtration System?\n",
    "    Answer: The potential child system element of Car Air filtration System could be the \"Air Filter Housing\" or \"Filter Element\".\n",
    "     \n",
    "    Context:\n",
    "    {context}\n",
    "\n",
    "    Question:\n",
    "    {question}\n",
    "    \"\"\"\n",
    "    \n",
    "    response = chat.invoke(prompt)\n",
    "    \n",
    "    return response.content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 224,
   "id": "17bf4982",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('db.index.vector.queryNodes' has been replaced by 'SEARCH')} {position: line: 2, column: 5, offset: 5} for query: \"\\n    CALL db.index.vector.queryNodes(\\n        'fmea_vector_index',\\n        5,\\n        $embedding\\n    )\\n    YIELD node, score\\n\\n    RETURN node.name as name,\\n        node.description as description,\\n        labels(node) as labels,\\n        score\\n    \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Matched Node: Body edge scrubbing process\n",
      "Answer: The potential child system elements of Body edge scrubbing could be the \"Charge Air connector pipe operation,\" \"Pre cleaner Body Clamp,\" or \"Maintain internal profile.\"\n"
     ]
    }
   ],
   "source": [
    "question = \"Which could be the potential child system element of Body edge scrubbing?\"\n",
    "response = talk(question)\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 222,
   "id": "1a078759",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The query used a deprecated procedure. ('db.index.vector.queryNodes' has been replaced by 'SEARCH')} {position: line: 2, column: 5, offset: 5} for query: \"\\n    CALL db.index.vector.queryNodes(\\n        'fmea_vector_index',\\n        5,\\n        $embedding\\n    )\\n    YIELD node, score\\n\\n    RETURN node.name as name,\\n        node.description as description,\\n        labels(node) as labels,\\n        score\\n    \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Matched Node: Maintain airflow through HVAC system\n",
      "Answer: The potential characteristics of the 'HVAC' function element could be \"Inspect-Dimension_10\" and \"Inspect-Dimension_11_10_7\".\n"
     ]
    }
   ],
   "source": [
    "question = \"Which could be the potential Characteristics of 'HVAC' function element?\"\n",
    "response = talk(question)\n",
    "print(response)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
