{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "7f4bc988",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Instance02\n",
      "neo4j+ssc://8c816eb4.databases.neo4j.io\n",
      "neo4j\n",
      "SjFH0CBSvP6ngGW2sACh6cvKzC8HNU2zN0zFJBEg1kE\n",
      "('neo4j', 'SjFH0CBSvP6ngGW2sACh6cvKzC8HNU2zN0zFJBEg1kE')\n"
     ]
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "import os\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "load_dotenv(override=True)\n",
    "\n",
    "AURA_INSTANCENAME = os.environ[\"AURA_INSTANCENAME\"]\n",
    "NEO4J_URI = os.environ[\"NEO4J_URI\"]\n",
    "NEO4J_USERNAME = os.environ[\"NEO4J_USERNAME\"]\n",
    "NEO4J_PASSWORD = os.environ[\"NEO4J_PASSWORD\"]\n",
    "AUTH = (NEO4J_USERNAME, NEO4J_PASSWORD)\n",
    "\n",
    "print(AURA_INSTANCENAME)\n",
    "print(NEO4J_URI)\n",
    "print(NEO4J_USERNAME)\n",
    "print(NEO4J_PASSWORD)\n",
    "print(AUTH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "ef3db805",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(NEO4J_URI, auth=AUTH)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b4f8d365",
   "metadata": {},
   "outputs": [],
   "source": [
    "def display_node_count():\n",
    "    driver = GraphDatabase.driver(NEO4J_URI, auth=AUTH)\n",
    "    try:\n",
    "        with driver.session() as session: \n",
    "            result = session.run(\"MATCH (n) RETURN count(n) AS count\")\n",
    "            for record in result:\n",
    "                print(record[\"count\"])\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "    finally:\n",
    "        driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "8a88a83e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node count before building the knowledge graph:\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "print (\"Node count before building the knowledge graph:\")\n",
    "display_node_count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "428293ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "def connect_and_query():\n",
    "    try:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(\"MATCH (n) RETURN count(n)\")\n",
    "            count = result.single().value()\n",
    "            print(f\"Number of nodes: {count}\")\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "    finally:\n",
    "        driver.close()\n",
    "\n",
    "def create_entities(tx):\n",
    "    # Create Albert Einstein node\n",
    "    tx.run(\"MERGE (a:Person {name: 'Albert Einstein'})\")\n",
    "\n",
    "    # Create other nodes\n",
    "    tx.run(\"MERGE (p:Subject {name: 'Physics'})\")\n",
    "    tx.run(\"MERGE (n:NobelPrize {name: 'Nobel Prize in Physics'})\")\n",
    "    tx.run(\"MERGE (g:Country {name: 'Germany'})\")\n",
    "    tx.run(\"MERGE (u:Country {name: 'USA'})\")\n",
    "\n",
    "\n",
    "def create_relationships(tx):\n",
    "    # Create studied relationship\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "    MATCH (a:Person {name: 'Albert Einstein'}), (p:Subject {name: 'Physics'})\n",
    "    MERGE (a)-[:STUDIED]->(p)\n",
    "    \"\"\"\n",
    "    )\n",
    "\n",
    "    # Create won relationship\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "    MATCH (a:Person {name: 'Albert Einstein'}), (n:NobelPrize {name: 'Nobel Prize in Physics'})\n",
    "    MERGE (a)-[:WON]->(n)\n",
    "    \"\"\"\n",
    "    )\n",
    "\n",
    "    # Create born in relationship\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "    MATCH (a:Person {name: 'Albert Einstein'}), (g:Country {name: 'Germany'})\n",
    "    MERGE (a)-[:BORN_IN]->(g)\n",
    "    \"\"\"\n",
    "    )\n",
    "\n",
    "    # Create died in relationship\n",
    "    tx.run(\n",
    "        \"\"\"\n",
    "    MATCH (a:Person {name: 'Albert Einstein'}), (u:Country {name: 'USA'})\n",
    "    MERGE (a)-[:DIED_IN]->(u)\n",
    "    \"\"\"\n",
    "    )\n",
    "\n",
    "\n",
    "# Function to connect and run a simple Cypher query\n",
    "def query_graph_simple(cypher_query):\n",
    "    driver = GraphDatabase.driver(NEO4J_URI, auth=AUTH)\n",
    "    try:\n",
    "        with driver.session() as session:\n",
    "            result = session.run(cypher_query)\n",
    "            for record in result:\n",
    "                print(record[\"name\"])\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "    finally:\n",
    "        driver.close()\n",
    "\n",
    "\n",
    "# Function to connect and run a Cypher query\n",
    "def query_graph(cypher_query):\n",
    "    driver = GraphDatabase.driver(NEO4J_URI, auth=AUTH)\n",
    "    try:\n",
    "        with driver.session() as session: \n",
    "            result = session.run(cypher_query)\n",
    "            for record in result:\n",
    "                print(record[\"path\"])\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "    finally:\n",
    "        driver.close()\n",
    "\n",
    "\n",
    "def build_knowledge_graph():\n",
    "    # Open a session with the Neo4j database\n",
    "\n",
    "    try:\n",
    "        with driver.session() as session: #database=NEO4J_DATABASE\n",
    "            # Create entities\n",
    "            session.execute_write(create_entities)\n",
    "            # Create relationships\n",
    "            session.execute_write(create_relationships)\n",
    "\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "    finally:\n",
    "        driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "1c382ca4",
   "metadata": {},
   "outputs": [],
   "source": [
    "# if __name__ == \"__main__\":\n",
    "#     build_knowledge_graph()\n",
    "\n",
    "# Cypher query to find paths related to Albert Einstein\n",
    "einstein_query = \"\"\"\n",
    "MATCH path=(a:Person {name: 'Albert Einstein'})-[:STUDIED]->(s:Subject)\n",
    "RETURN path\n",
    "UNION\n",
    "MATCH path=(a:Person {name: 'Albert Einstein'})-[:WON]->(n:NobelPrize)\n",
    "RETURN path\n",
    "UNION\n",
    "MATCH path=(a:Person {name: 'Albert Einstein'})-[:BORN_IN]->(g:Country)\n",
    "RETURN path\n",
    "UNION\n",
    "MATCH path=(a:Person {name: 'Albert Einstein'})-[:DIED_IN]->(u:Country)\n",
    "RETURN path\n",
    "\"\"\"\n",
    "\n",
    "# Simple Cypher query to find all node names\n",
    "simple_query = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN n.name AS name\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76b310ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\g4dqxc\\AppData\\Local\\Temp\\ipykernel_2908\\1907977906.py:89: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session: #database=NEO4J_DATABASE\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Albert Einstein\n",
      "Physics\n",
      "Nobel Prize in Physics\n",
      "Germany\n",
      "USA\n",
      "<Path start=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:0' labels=frozenset({'Person'}) properties={'name': 'Albert Einstein'}> end=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:1' labels=frozenset({'Subject'}) properties={'name': 'Physics'}> size=1>\n",
      "<Path start=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:0' labels=frozenset({'Person'}) properties={'name': 'Albert Einstein'}> end=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:2' labels=frozenset({'NobelPrize'}) properties={'name': 'Nobel Prize in Physics'}> size=1>\n",
      "<Path start=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:0' labels=frozenset({'Person'}) properties={'name': 'Albert Einstein'}> end=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:3' labels=frozenset({'Country'}) properties={'name': 'Germany'}> size=1>\n",
      "<Path start=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:0' labels=frozenset({'Person'}) properties={'name': 'Albert Einstein'}> end=<Node element_id='4:5f6b4eec-e38d-45af-9ccd-664b3d1842fb:4' labels=frozenset({'Country'}) properties={'name': 'USA'}> size=1>\n"
     ]
    }
   ],
   "source": [
    "if __name__ == \"__main__\":\n",
    "    # Build the knowledge graph\n",
    "    build_knowledge_graph()\n",
    "\n",
    "    query_graph_simple(\n",
    "        simple_query\n",
    "    )\n",
    "    query_graph(einstein_query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "afb1f1e8",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Run this to see the entire graph in the neo4j browser/console\n",
    "# MATCH (n)-[r]->(m)\n",
    "# RETURN n, r, m;"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
